#include <stdio.h>
#include <locale.h>

int main() {
    setlocale(LC_CTYPE, "RUS");

    double a, b;
    printf("Введите два целых числа a и b: ");
    scanf("%lg %lg", &a, &b);

    // Верхняя граница таблицы
    printf("_________________________________________________________________________________________________\n");

    // Заголовки таблицы
    printf("|             a * b             |                a+b            |              a-b              |\n");

    // Разделитель
    printf("-------------------------------------------------------------------------------------------------\n");

    // Выражения
    printf("|  %12g * %-12g  |  %12g + %-12g  |  %12g - %-12g  |\n",
        a, b, a, b, a, b);

    // Разделитель
    printf("-------------------------------------------------------------------------------------------------\n");

    // Результаты
    printf("|    %22g     |    %22g     |    %22g     |\n",
        a * b, a + b, a - b);

    // Нижняя граница
    printf("_________________________________________________________________________________________________\n");

    return 0;
}