#include <stdio.h>
#include <locale.h>

int main() {
    setlocale(LC_CTYPE, "RUS");

    double a, b;
    printf("Введите два целых числа a и b: ");
    scanf("%lg %lg", &a, &b);

    // Верхняя граница таблицы
    printf("_____________________________________________________________________________________\n");

    // Заголовки таблицы
    printf("|          a * b            |             a+b           |            a-b            |\n");

    // Разделитель
    printf("-------------------------------------------------------------------------------------\n");

    // Выражения
    printf("|  %10g * %-10g  |  %10g + %-10g  |  %10g - %-10g  |\n",
        a, b, a, b, a, b);

    // Разделитель
    printf("-------------------------------------------------------------------------------------\n");

    // Результаты
    printf("|    %18g     |    %18g     |    %18g     |\n",
        a * b, a + b, a - b);

    // Нижняя граница
    printf("_____________________________________________________________________________________\n");

    return 0;
}