#include <stdio.h>
#include <locale.h>

int main() {
    setlocale(LC_CTYPE, "RUS");

    double a, b;
    printf("Введите два целых числа a и b: ");
    scanf("%lg %lg", &a, &b);

    // Верхняя граница таблицы
    printf("_______________________________________________________\n");

    // Заголовки таблицы
    printf("|      a * b      |       a+b       |       a-b       |\n");

    // Разделитель
    printf("-------------------------------------------------------\n");

    // Выражения
    printf("|  %5g * %-5g  |  %5g + %-5g  |  %5g - %-5g  |\n",
        a, b, a, b, a, b);

    // Разделитель
    printf("-------------------------------------------------------\n");

    // Результаты
    printf("|    %9g    |    %9g    |    %9g    |\n",
        a * b, a + b, a - b);

    // Нижняя граница
    printf("_______________________________________________________\n");

    return 0;
}